fisherman/await
fisherman/docker-completion
timbovelander/fasd
fisherman/fnm
fisherman/get_file_age
oh-my-fish/plugin-git-flow
fisherman/last_job_id
fisherman/menu
